; domain
(define (domain lego_star_wars)
  (:requirements :strips :typing)
  (:types 
    entity
  )
  (:predicates 
    (game_played ?e - entity)
    (selection_made ?e - entity)
    (name_saved ?e - entity)
    (level_completed ?e - entity)
  )

  (:action start_game
    :parameters (?g - entity)
    :precondition (not (game_played ?g))
    :effect (game_played ?g)
  )
  
  (:action select_character_parts
    :parameters (?s - entity)
    :precondition (not (selection_made ?s))
    :effect (selection_made ?s)
  )
  
  (:action save_name_and_exit
    :parameters (?n - entity)
    :precondition (and (selection_made ?n) (not (name_saved ?n)))
    :effect (name_saved ?n)
  )
  
  (:action complete_level
    :parameters (?l - entity)
    :precondition (and (name_saved ?l) (not (level_completed ?l)))
    :effect (level_completed ?l)
  )
)

; problem
(define (problem create_character)
  (:domain lego_star_wars)
  (:objects 
    game - entity
    character - entity
    level - entity
  )
  (:init 
    (not (game_played game))
    (not (selection_made character))
    (not (name_saved character))
    (not (level_completed level))
  )
  (:goal 
    (and 
      (game_played game)
      (selection_made character)
      (name_saved character)
      (level_completed level)
    )
  )
)

; plan
1. (select_character_parts level)
   added: (selection_made level)
   goals met: 0 of 4
2. (save_name_and_exit level)
   added: (name_saved level)
   goals met: 0 of 4
3. (select_character_parts character)
   added: (selection_made character)
   goals met: 1 of 4
4. (save_name_and_exit character)
   added: (name_saved character)
   goals met: 2 of 4
5. (complete_level level)
   added: (level_completed level)
   goals met: 3 of 4
6. (start_game game)
   added: (game_played game)
   goals met: 4 of 4
